app/Models/Aqdb.php

    public function getQuestionsWithOptions()
    {
        return $this->db->table('questions')
            ->select('questions.id as question_id, questions.question_text, options.id as option_id, options.option_text, options.type')
            ->join('options', 'options.question_id = questions.id')
            ->orderBy('questions.question_order', 'ASC')
            ->get()->getResultArray();
---
SELECT `questions`.`id` as `question_id`, `questions`.`question_text`, `options`.`id` as `option_id`, `options`.`option_text`, `options`.`type`
FROM `questions`
JOIN `options` ON `options`.`question_id` = `questions`.`id`
ORDER BY `questions`.`question_order` ASC

    public function getScoreMatrix()
    {
        return $this->db->table('score_matrix')->get()->getResultArray();
---
SELECT *
FROM `score_matrix`